# DATA VISUALIZATION OF TITANIC PROBLEM

#using pandas

In [1]:
import pandas as pd

In [2]:
train = pd.read_csv('http://bit.ly/kaggletrain')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
train['Sexno'] = train.Sex.map({"female":0, "male":1})
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sexno
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [4]:
#replacing female with 1 and male with 0
train["Sex"] = train["Sexno"]
del train["Sexno"]
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

In [7]:
#calculating the length of names in dataset 
train['Name_len'] = train.Name.apply(len)

In [10]:
train.loc[0:10,["Name", "Name_len"]]

                                                 Name  Name_len
0                             Braund, Mr. Owen Harris        23
1   Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                              Heikkinen, Miss. Laina        22
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)        44
4                            Allen, Mr. William Henry        24
5                                    Moran, Mr. James        16
6                             McCarthy, Mr. Timothy J        23
7                      Palsson, Master. Gosta Leonard        30
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)        49
9                 Nasser, Mrs. Nicholas (Adele Achem)        35
10                    Sandstrom, Miss. Marguerite Rut        31

In [11]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_len
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,23
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,51
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,22
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,44
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,24

In [13]:
#rearranging the dataframe
train = train[['PassengerId' , 'Survived' , 'Pclass' , 'Name' , 'Name_len' , 'Sex', "Age" , "SibSp" , "Parch" , "Ticket", "Fare" , "Cabin", "Embarked" ]]
train.head()

,PassengerId,Survived,Pclass,Name,Name_len,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",23,1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",51,0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",22,0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",44,0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",24,1,35.0,0,0,373450,8.0500,NaN,S

Rounding the Fare column using numpy

In [14]:
import numpy as np

In [15]:
#using ceiling function
train["Fare_ceil"] = train.Fare.apply(np.ceil)

In [16]:
train.head()

,PassengerId,Survived,Pclass,Name,Name_len,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_ceil
0,1,0,3,"Braund, Mr. Owen Harris",23,1,22.0,1,0,A/5 21171,7.2500,NaN,S,8.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",51,0,38.0,1,0,PC 17599,71.2833,C85,C,72.0
2,3,1,3,"Heikkinen, Miss. Laina",22,0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,8.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",44,0,35.0,1,0,113803,53.1000,C123,S,54.0
4,5,0,3,"Allen, Mr. William Henry",24,1,35.0,0,0,373450,8.0500,NaN,S,9.0

In [17]:
train.loc[0:4,["Fare" , "Fare_ceil"]]

      Fare  Fare_ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0